// Доработайте код из предыдущего задания. 
// Оцените, насколько легко получается модифицировать готовый код.
// Теперь нужно посчитать количество букв в первом слове и удалить слово с индексом, 
// равным количеству букв первого слова

// запуск тестов npm run 2.4



//! Не меняйте название функции - не пройдете тесты
export function capitalazeWordsV2(text: string): string {
    return text;
}

//! Вы увидите результат вызова скрипта, когда запустите тесты. 
//! Не меняйте название функции, содержимое в вашем распоряжении
export function demo(): void {
    const text = 'а бв где?'
    
    console.log(capitalazeWordsV2(text)) // Должно получиться 'А Где
}






































//? Подсказка
//? А на егэ и на работе тоже будут подсказки внизу в комментах?)