// Используя примитивную типизацию с помощью TypeScript, напишите код, который:
// 1) Принимает число.
// 2) Возводит в квадрат все ЦИФРЫ этого числа и конкатенирует их, то есть склеивает обратно в одно число и возвращает его.
// 3) Если число отрицательное - функция возвращает его обратно
// Для зауска тестов npm run 1.6


//! Не меняйте название функции - не пройдете тесты
export function powDigits(num) {
    // todo
}

//! Вы увидите результат вызова скрипта, когда запустите тесты. 
//! Не меняйте название функции, содержимое в вашем распоряжении
export function demo(): void {
    const num = 9119
    console.log(powDigits(num))   // Должно получиться 811181
}


































//? Подсказка
//? Давайте сами